&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.Цена = РаботаСЦенами.ПолучитьЦенуПродажи(ТекущиеДанные.Номенклатура, , Объект.Дата);
	Иначе
		ТекущиеДанные.Цена = 0;
	КонецЕсли;
	
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	РасчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Услуга) Тогда
		ТекущиеДанные.Цена = РаботаСЦенами.ПолучитьЦенуПродажи(ТекущиеДанные.Услуга, , Объект.Дата);
	Иначе
		ТекущиеДанные.Цена = 0;
	КонецЕсли;
	
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	РасчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	РасчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	РасчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	РасчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	РасчитатьСуммуДокумента();

КонецПроцедуры  

&НаКлиенте 
Процедура РасчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры





