
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	ФормированиеНаименования();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ФормированиеНаименования();
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьВидимость();
		
	Элементы.ДатаОкончания.Видимость = Не Объект.Бессрочный; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеНаименования()
	
	Объект.Наименование = "№" + Объект.Номер + " от: " + Формат(Объект.ДатаНачала, "ДФ=""dd.MM.yyyy 'г'""");
	
КонецПроцедуры

