&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьПравильностьЗаполненияРеквизитовПередЗаписью(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура VINПриИзменении(Элемент)
	
	ФормированиеНаименования();

КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	ФормированиеНаименования();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеНаименования()

	Объект.Наименование = Строка(Объект.Модель) + " (VIN:" + Объект.VIN + ")";

КонецПроцедуры

&НаСервере
Процедура ПроверитьПравильностьЗаполненияРеквизитовПередЗаписью(Отказ)
	
	ЭтоКлиент = (Объект.Владелец.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель);
	
	Если Не ЭтоКлиент Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

