&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	 ПроверкаИНН(Отказ);
	 
 КонецПроцедуры
 
&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИНН(Отказ)
	
	ЭтоИП = (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель"));
	ЭтоЮрЛицо = (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо"));
	
	Если ЭтоИП И СтрДлина(Объект.ИНН) <> 12 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для ИП ИНН должно быть 12 символов";
		Сообщение.Сообщить();
		Отказ = Истина;
	ИначеЕсли ЭтоЮрЛицо И СтрДлина(Объект.ИНН) <> 10 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для ЮЛ ИНН должно быть 10 символов";
		Сообщение.Сообщить(); 
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоЮрЛицо = (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо"));
	
	Элементы.ГлавныйБухгалтер.Видимость = ЭтоЮрЛицо;
	
КонецПроцедуры



