
Функция getUserGet(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username")); 
	
	Если Логин = Неопределено Тогда
		Возврат Новый HTTPСервисОтвет(400, "Не передан параметр username");
	КонецЕсли;
	
	ЗапросПользователя = Новый Запрос;
	ЗапросПользователя.Текст = 
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
	|	Пользователи.Наименование КАК Наименование,
	|	Пользователи.Код КАК Код
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Наименование = &Наименование
	|	И НЕ Пользователи.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	ЗапросПользователя.УстановитьПараметр("Наименование", Логин);
	
	Выборка = ЗапросПользователя.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Новый HTTPСервисОтвет(401, "Пользователь не найден");
	КонецЕсли;
	
	ДанныеПользователя = Новый Структура();
	ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
	ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
	ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование)); 
	
	Ответ = Новый HTTPСервисОтвет(200);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеПользователя);
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
	
	Возврат Ответ;
	
КонецФункции
