Процедура РассчитатьСуммуНачисления() Экспорт
	
	ДнейОплаченогоБольничного = 3;
	
	Для Каждого Движение Из ЭтотОбъект Цикл		
		
		Если Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад Тогда
			
			Оклад = Движение.ПоказательРасчета;
			ОтработаноЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("КоличествоЧасов");
			НормаЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия).Итог("КоличествоЧасов");
			РезультатРасчета = Оклад * ОтработаноЧасов / НормаЧасов;
			Движение.Сумма = РезультатРасчета;
			
		ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный Тогда 
			
			Оклад = Движение.ПоказательРасчета;
			СтоимостьОдногоДня = Оклад * 24 / 740;
			КоличествоДнейБолезни = (КонецДня(Движение.ПериодДействияКонец) + 1 - Движение.ПериодДействияНачало) / 86400;
			Если КоличествоДнейБолезни <= ДнейОплаченогоБольничного Тогда
				РезультатРасчета = КоличествоДнейБолезни * СтоимостьОдногоДня;
				ДнейОплаченогоБольничного = ДнейОплаченогоБольничного - КоличествоДнейБолезни;
			Иначе
				РезультатРасчета = ДнейОплаченогоБольничного * СтоимостьОдногоДня;
				ДнейОплаченогоБольничного = 0;
			КонецЕсли;
			
			Движение.Сумма = РезультатРасчета;
			
		ИначеЕсли Движение.ВидРасчета.Предопределенный = Ложь Тогда
			
			РезультатРасчета = Неопределено;
			ФормулаРасчета = Движение.ВидРасчета.ФормулаРасчета;    
			Выполнить(ФормулаРасчета);
			Движение.Сумма = РезультатРасчета;
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Для вида расчета %1 не задана формула", Движение.ВидРасчета);
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЦикла;
			
	ЭтотОбъект.Записать(, Истина);		
	
КонецПроцедуры;