&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьВидимостьДоговора();
	УстановитьТипПлательщикаПоВидуОперации();
		
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьТипПлательщикаПоВидуОперации();
	УстановитьВидимостьДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	
	УстановитьВидимостьДоговора();
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьТипПлательщикаПоВидуОперации()
	
	МассивТипов = Новый Массив();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда		
		МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники")); 
	Иначе   		
		МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты")); 		
	КонецЕсли; 
	
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	
	Элементы.Плательщик.ОграничениеТипа = ОписаниеТипа; 
	Объект.Плательщик = ОписаниеТипа.ПривестиЗначение(Объект.Плательщик); 
	
КонецПроцедуры 

&НаСервере 
Процедура УстановитьВидимостьДоговора()
	
	ПлательщикНеЯвляетсяПоставщиком = Истина;
	
	Если ТипЗнч(Объект.Плательщик) = Тип("СправочникСсылка.Контрагенты") Тогда 
		Если Объект.Плательщик.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель Тогда
			ПлательщикНеЯвляетсяПоставщиком = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника Тогда
		ПлательщикНеЯвляетсяПоставщиком = Ложь;
	КонецЕсли;  
	
	Элементы.Договор.Видимость = ПлательщикНеЯвляетсяПоставщиком;
	
КонецПроцедуры







