
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	
	РасчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	
	РасчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	
	РасчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	РаботаСТЧ.ПересчитатьСумму(ТекущиеДанные);
	
	РасчитатьСуммуДокумента();

КонецПроцедуры 

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	ТекущиеДанные.СтатьяЗатрат = ПолучитьСтатьюЗатратИзНоменклатуры(ТекущиеДанные.Услуга);
		
КонецПроцедуры 

&НаКлиенте 
Процедура РасчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатьюЗатратИзНоменклатуры(Номенклатура)
	
	Возврат Номенклатура.СтатьяЗатрат;
	
КонецФункции

