
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоговора(); 
	УстановитьТипаПолучателяПоВидуОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьДоговора();
	УстановитьТипаПолучателяПоВидуОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	 УстановитьВидимостьДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипаПолучателяПоВидуОперации()

	МассивТипов = Новый Массив();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику") ИЛИ
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты") Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
	Иначе		
		МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	
	Элементы.Получатель.ОграничениеТипа = ОписаниеТипа;
	Объект.Получатель = ОписаниеТипа.ПривестиЗначение(Объект.Получатель);
 
КонецПроцедуры

&НаСервере 
Процедура УстановитьВидимостьДоговора()

	ПолучательНеЯвляетсяПоставщиком = Истина;
	
	Если ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если Объект.Получатель.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель Тогда
			ПолучательНеЯвляетсяПоставщиком = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику ИЛИ
		Объект.ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты Тогда
		ПолучательНеЯвляетсяПоставщиком = Ложь;
	КонецЕсли;
	
	Элементы.Договор.Видимость = ПолучательНеЯвляетсяПоставщиком;
			
КонецПроцедуры

	
