
Функция registerUserGet(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("phone"));
	
	Если Логин =  Неопределено Или Телефон = Неопределено Тогда
		Возврат Новый HTTPСервисОтвет(400, "Не передан параметр username или phone");
	КонецЕсли;
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = Логин;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	НовыйПользовательИБ.Записать();
	
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
	НовыйПользователь.Наименование = Логин;

	
	НовыйКлиент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКлиент.Наименование = Логин;
	НовыйКлиент.КонтактныйТелефон = Телефон;
	НовыйКлиент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель;
	НовыйКлиент.Родитель = Справочники.Контрагенты.Покупатель;
	НовыйКлиент.Комментарий = "Контрагент зарегистрирован через мобильное приложение.";
	НовыйКлиент.Записать();  
	
	НовыйПользователь.Покупатель = НовыйКлиент.Ссылка; 
	НовыйПользователь.Записать();
	
	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("guid", Строка(НовыйПользователь.Ссылка.УникальныйИдентификатор()));
	ДанныеПользователя.Вставить("name", Логин);
	ДанныеПользователя.Вставить("phone", Телефон);
	ДанныеПользователя.Вставить("code", Строка(НовыйПользовательИБ.УникальныйИдентификатор));
	
	Ответ = Новый HTTPСервисОтвет(200);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеПользователя);	
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
	
	Возврат Ответ;
	 
КонецФункции
